app/controllers/categories_controller.rb

SELECT * FROM `categories`
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def show
    @categories = Category.all
    @category = Category.find(params[:id])