app/controllers/items_controller.rb

  def create
#    raise params.inspect
    @item = Item.new(params[:item])
    if @item.save
---
INSERT INTO `items` (`name`, `buy_now`, `updated_at`, `tip`, `category_id`, `created_at`, `image_file_name`) VALUES('ads', NULL, '2009-04-25 11:08:50', NULL, NULL, '2009-04-25 11:08:50', NULL)